Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: animals breathe in oxygen and breathe out carbon dioxide all through the day and the night .
af: dwarsdeur die dag en nag neem diere suurstof in en asem koolstofdioksied uit .

source: oxygen is used to release energy from food inside the body which is used for the life processes .
af: suurstof word gebruik om energie uit die voedsel vry te stel wat vir al die lewensprosesse in die liggaam benodig word .

source: do you remember what the seven life processes of living things are ?
af: kan jy onthou wat die sewe lewensprosesse van alle lewende dinge is ?

source: write them down below .
af: skryf hulle hieronder neer .

source: movement reproducing sensing feeding excreting breathing growing .
af: beweging voortplanting sintuiglike waarneming voeding uitskeiding asemhaling gaswisseling vir respirasie groei .

source: just like animals plants also use oxygen throughout the day and the night .
af: net soos enige ander lewende wese gebruik plante ook suurstof dwarsdeur die dag en nag .

source: oxygen is necessary for plant growth and the development of new plants seeds leaves and shoots for example .
af: plante gebruik suurstof om te groei sowel as vir die ontwikkeling van byvoorbeeld nuwe plante sade blare en lote .

source: plants therefore also produce carbon dioxide as a 'waste product' once the oxygen has been used .
af: daarom produseer plante ook koolstofdioksied as 'n afvalproduk wanneer hulle suurstof gebruik .

source: plants do not photosynthesise through the night because there is no sunlight energy available to do that .
af: plante fotosinteer nie gedurende die nag nie omdat daar nie sonenergie beskikbaar is nie .

source: this means that plants only need carbon dioxide during the day for photosynthesis .
af: daarom kan hulle slegs bedags koolstofdioksied vir fotosintese gebruik .

source: this cycle of using and producing both oxygen and carbon dioxide is very important to life on earth .
af: hierdie siklus van gebruik en produksie van beide suurstof en koolstofdioksied is baie belangrik vir lewe op aarde .

source: make a list of living organisms that produce both oxygen and carbon dioxide in this picture .
af: maak 'n lys van lewende organismes in hierdie illustrasie wat beide suurstof en koolstofdioksied kan produseer .

source: tree reeds water plants and shrubs on the bank
af: bome riete waterplante en die struike op die wal .

source: identify three living organisms that cannot produce oxygen in this picture .
af: identifiseer drie lewende organismes in hierdie illustrasie wat nie suurstof kan produseer nie .

source: fish duiker buck squirrel dragonfly
af: vis duiker bok eekhoring naaldekoker

source: predict what you think would happen if all the animals were removed from this habitat .
af: voorspel wat jy dink sal gebeur indien al die diere uit hierdie habitat verwyder word .

source: probably not much would change as the leaves that decay would still give off carbon dioxide for the plants to use as well as the carbon dioxide that the plants produce themselves .
af: daar sal tien teen een nie veel gebeur nie aangesien die blare wat verrot steeds koolstofdioksied sal afgee vir die plante om te gebruik tesame met die koolstofdioksied wat die plante self produseer .

source: what two life processes are involved in the carbon dioxide oxygen cycle ?
af: watter een van die sewe lewensprosesse is by diekoolstofdioksied suurstofkringloop betrokke ?

source: breathing in oxygen and giving off carbon dioxide
af: inneem van suurstof en afskei van koolstofdioksied gaswisseling vir respirasie asemhaling

source: complete this cycle by filling in the missing information for the two arrows on the left hand side of the illustration .
af: voltooi die kringloop deur die ontbrekende inligting vir die twee pyle aan die linkerkant van die illustrasie in te vul .

source: supply the labels for arrows 1 and 2 .
af: benoem hulle pyle 1 en 2 .

source: explain why animals would not survive if all the plants on earth were to suddenly die .
af: verduidelik waarom diere nie sal oorleef indien alle plante op aarde skielik sou uitsterf nie .

source: why do we say the oxygen and carbon dioxide are in a cycle ?
af: hoekom s ons dat suurstof en koolstofdioksied in 'n kringloop siklus gevorm word ?

source: for life on earth to continue there needs to be an unlimited supply of carbon dioxide and oxygen .
af: vir lewe op aarde om voort te gaan moet daar 'n onbeperkte voorraad koolstofdioksied en suurstof wees .

source: it is in a cycle to ensure that similar amounts of both are produced .
af: dit gebeur in 'n kringloop of siklus om te verseker dat genoegsame hoeveelhede van albei geproduseer word .

source: list the four things that are vitally important for plants and photosynthesis .
af: maak 'n lys van die vier dinge wat lewensbelangrik vir plante en fotosintese is .

source: sunlight energy water carbon dioxide chlorophyll
af: sonligenergie water koolstofdioksied chlorofil

source: the seedlings that were planted in the newspaper cuttings or cotton wool did not grow very well at all even though they had sunlight and water .
af: die saailinge wat in die koerantpapier of watte geplant is het glad nie baie goed gegroei nie alhoewel hulle sonlig en water gehad het .

source: what could they not get from the newspaper or cotton wool that plants normally get from soil ?
af: wat kon hulle nie uit die koerantpapier of watte kry wat plante normaalweg uit die grond kry nie ?

source: nutrients and minerals
af: minerale voedingstowwe

source: where does photosynthesis usually take place ?
af: waar vind fotosintese gewoonlik plaas ?

source: photosynthesis usually takes place in the leaves .
af: fotosintese vind gewoonlik in die blare plaas .

source: the leaves are green as they contain chlorophyll .
af: die blare is groen omdat hulle chlorofil bevat .

source: leaves also face the sunlight and are exposed to the most sun to drive the process of photosynthesis .
af: blare wys ook in die rigting van die sonlig en word die meeste aan die son blootgestel om sodoende die proses van fotosintese te vergemaklik .

source: do you think photosynthesis takes place at night ?
af: dink jy fotosintese vind snags plaas ?

source: no it will not take place .
af: nee dit vind nie plaas nie .

source: at night there is no sunlight energy to drive the process of photosynthesis .
af: snags is daar geen sonligenergie om die proses van fotosintese te dryf nie .

source: what is the name given to the sugar that plants produce during photosynthesis ?
af: wat word die suiker genoem wat plante gedurende die proses van fotosintese produseer ?

source: glucose
af: glukose

source: what do plants store glucose as ?
af: in watter vorm berg plante glukose ?

source: list some places where it is stored .
af: lys sommige van die plekke waar dit geberg word .

source: starch stored in leaves stems roots flowers seeds fruits .
af: stysel; word gestoor in blare stingels wortels blomme sade en vrugte .

source: learners must collect the wrappers and packaging material of the food they eat for the activity that follows .
af: leerders moet die omhulsels en verpakkings van die kos wat hulle eet vir die volgende aktiwiteit bymekaar maak .

source: advise them to wash all tins or plastic that still contains food particles to avoid nasty odours and insect infestations in your class !
af: vra hulle om alle blikkies en plastiek wat nog kosstukkies bevat uit te spoel om slegte reuke en insekbesmetting in die klas te voorkom !

source: all living plants and animals need to feed or eat to give them energy to carry out the life processes .
af: alle lewende plante en diere moet voedsel inneem vir die nodige energie om hulle lewensprosesse te kan uitvoer .

source: plants make their own food from sunlight water and carbon dioxide through the process of photosynthesis .
af: plante maak hulle eie voedsel met behulp van sonlig water en koolstofdioksied deur die proses van fotosintese .

source: animals cannot make their own food and need to eat plants or other animals to get energy .
af: diere kan nie hul eie voedsel produseer nie en moet plante of ander diere inneem om energie te verkry .

source: people also have to eat plant or animal products to get energy to grow and develop .
af: mense moet ook plant of dierprodukte eet om energie te kry om te groei en te ontwikkel .

source: the food we eat can be grouped or classified into different types or groups .
af: die voedsel wat ons eet kan in verskillende tipes of groepe geklassifiseer of groepeer word .

source: we call these food groups .
af: ons noem dit voedselgroepe .

source: there are a four main food groups and each food group does a different job in the body
af: daar is vier hoofvoedselgroepe en elke voedselgroep verrig 'n spesifieke funksie in die liggaam .

source: we classify food according to these food groups although most foods contain a mixture of more than one nutrient group .
af: ons klassifisser voedsel volgens hierdie voedselgroepe alhoewel die meeste voedsels 'n mengsel van meer as een groep bevat .

source: let's look at each food group separately and see why each one is important
af: kom ons kyk na elke voedselgroep om te sien waarom elkeen belangrik is

source: vitamin a
af: vitamien a

source: egg yolk liver deep yellow and deep green fruits and vegetables fish liver oils
af: eiergeel lewer donkergeel en donkergroen vrugteen groente vislewerolies .

source: enables the eye to produce a pigment that helps us to see in dim light .
af: stel die oog in staat om 'n pigment te produseer wat ons help om in skemerlig te kan sien .

source: vitamin b
af: vitamien b

source: brown rice whole wheat bread
af: bruin rys volgraanbrood

source: there are several types of vitamin b and they have many functions e.g. they are important in the chemical reactions of breathing .
af: daar is verskeie tipes vitamien b met baieverskillende funksies .

source: vitamin c
af: vitamien c

source: citrus fruit strawberries tomatoes peppers
af: sitrusvrugte aarbeie tamaties rissies

source: strengthens the body's immune system by increasing its ability to fight infections .
af: versterk die liggaam se immuunstelsel deur mens se vermo om infeksie teen te werk te verhoog .

source: vitamin d
af: vitamien d

source: egg yolk fish liver oils can be made in the skin when the ultra violet rays from the sun convert cholesterol in the skin to vitamin d
af: eiergeel vislewerolies .

source: helps the absorption of calcium and phosphate .
af: help met die absorpsie van kalsium en fosfaatsoute .

source: these nutrients are used for the making of strong bones and teeth .
af: hierdie voedingstowwe word gebruik in die vorming van sterk bene en tande .

source: a simulation about eating and exercise
af: 'n simulasie oor eet en oefening http goo.gl 7apcr

source: choose the 3 foods that you think are the most healthy to eat from the different wrappers and boxes that you have in your group .
af: kies uit die verskillende omhulsels en kartonhouers in julle groep die drie voedselsoorte wat julle dink die gesondste is om te eet .

source: write a reason next to each of these 3 choices why you think they are really healthy .
af: skryf 'n rede waarom julle dink dat dit regtig gesond is langs elkeen van hierdie drie keuses .

source: very often food manufacturers add different preservatives flavourings and colourings as well as salt and sugar to make the food look or taste more attractive to their customers .
af: voedselprodusente voeg dikwels verskillende preserveermiddels geur en kleurmiddels sowel as sout en suiker by om die kos meer aanloklik vir hulle gebruikers te laat lyk of smaak .

source: these are called additives .
af: ons noem dit bymiddels .

source: others
af: ander

source: example
af: voorbeeld

source: bread
af: brood

source: make a list of the main flavourings that were used in your products .
af: maak 'n lys van die hoofgeurmiddels wat in die produkte gebruik is .

source: what preservatives are used most often by the food manufacturers ?
af: watter preserveermiddels word die meeste deurvoedselvervaardigers gebruik ?

source: after doing this activity did you notice a difference between foods which are naturally occurring such as meat and vegetables and foods which have been processed ?
af: nadat jy hierdie aktiwiteit uitgevoer het het jy 'n verskil opgemerk tussen voedselsoorte wat natuurlik voorkom soos vleis en groente en verwerkte voedsels ?

source: the natural foods contained a mixture of more than one nutrient group .
af: die natuurlike voedsels bevat 'n mengsel van meer as een voedselgroep .

source: for example nuts are a source of protein and fat .
af: neute is byvoorbeeld 'n bron van proteen en vet .

source: milk is a source of calcium and protein .
af: melk is 'n bron van kalsium en proteen .

source: vegetables contain many nutrient groups .
af: groentes bevat verskeievoedselgroepe .

source: the foods which have been processed or manufactured often contained additives such as salt sugar preservatives and flavourings .
af: die voedsel wat verwerk of vervaardig is bevat dikwels bymiddels soos sout suiker preserveermiddels en geurmiddels .

source: suggested project if required teachers can use this opportunity for a small research project on additives and the pros and cons of eating foods with additives .
af: voorgestelde projek indien nodig kan onderwysers hierdie geleentheid gebruik vir 'n klein navorsingsprojek oor bymiddels en die voordele en nadele daarvan om voedsel met bymiddels te gebruik .

source: let's have a look at some different meals to see if we have all the food groups .
af: kom ons kyk na 'n paar verskillende maaltye om te sien of al die voedselgroepe ingesluit is .

source: meal
af: maaltyd

source: food groups
af: voedselgroepe

source: which meal do you think is the healthiest ?
af: watter maaltyd dink jy is die gesondste ?

source: in the next chapter we will look more at what makes up a balanced meal .
af: in die volgende hoofstuk gaan ons verder kyk na waaruit 'n gebalanseerde maaltyd alles bestaan .

source: foods are classified into the following food types carbohydrates proteins and .
af: kos word in die volgende voedselsoorte geklassifiseer en .

source: name 3 reasons why lipids are important in our diet .
af: noem drie redes waarom lipiede in ons dieet belangrik is .

source: fat is stored around organs for protection .
af: vette word rondom ons organe vir beskerming gestoor .

source: fat is stored under the skin to insulate us .
af: vette word onder ons vel gestoor om ons te isoleer teen hitteverlies .

source: fat can be used as reserve energy if there is a shortage of carbohydrates .
af: vette kan as reserwe energie gebruik word wanneer daar 'n tekort aan koolhidrate is .

source: list 3 sources of proteins .
af: lys drie bronne van proteene .

source: meat fish chicken eggs beans milk cheese accept any 3 sources of protein .
af: vleis vis hoender eiers bone melk kaas aanvaar enige drie bronne van proteen .

source: why is it necessary to supplement our diets with vitamins ?
af: hoekom is dit soms nodig om ons dieet met vitamiene aan te vul ?

source: allow learners to give their own reasons .
af: laat leerders toe om hulle eie redes te verskaf .

source: enables the eye to produce a pigment that helps us to see in dim light
af: stel die oog in staat om 'n pigment te produseerwat ons help om in skemerlig te kan sien .

source: there are several types of this vitamin and they have many functions in the chemical reactions of cellular respiration
af: daar is verskeie van hierdie vitamiene en hulleverrig funksies in die chemiese reaksies van sellulre respirasie .

source: strengthens the body's immune system by increasing its ability to fight infections
af: versterk die liggaam se immuunstelsel deur dievermo om infeksies teen te werk te verhoog .

source: egg yolks fish liver oils can be made in the skin when the ultra violet rays from the sun convert cholesterol in the skin to vitamin d
af: eiergele vislewer olies .

source: used for the making of strong bones and teeth
af: word gebruik om sterk bene en tande te maak

source: what are some of the additives that processed foods contain ?
af: wat is sommige van die bymiddels wat ons in verwerkte kossoorte vind ?

source: salt sugar preservatives flavourings colourings
af: sout suiker preserveermiddels geurmiddels kleurmiddels

source: a vegetarian is someone who does not eat meat .
af: 'n vegetarir is iemand wat nie vleis eet nie .

source: what other foods besides meat should they be eating and why ?
af: watter ander voedselsoorte behalwe vleis behoort hulle te eet en hoekom ?

source: a vegetarian might not get enough protein .
af: 'n vegetarir mag dalk nie genoeg proteene inneem nie .

source: they should eat other sources of proteins such as eggs beans cheese and other dairy products and nuts .
af: hulle moet ander bronne van proteen eet soos eiers bone kaas en ander suiwelprodukte en neute .

source: now we know that there are different foods that are classified into the four food groups .
af: ons weet nou reeds dat daar verskillende voedsels is wat in die vier voedselgroepe geklassifiseer word .

source: the next step is to see what amounts of each food group we need to eat regularly to stay healthy .
af: die volgende stap is om te kyk na hoeveel van elke voedselgroep ons gereeld moet eet om gesond te bly .

source: this is called a balanced diet .
af: ons noem dit 'n gebalanseerde dieet .

source: what is a diet ?
af: wat is 'n dieet ?

source: discuss the word 'diet' with your class and come up with a definition for this word .
af: bespreek die woord dieet met jou klasmaats en formuleer 'n definisie vir hierdie woord .

source: write it below .
af: skryf dit hieronder neer .

source: for nutritional scientists people who study the effects of diet on health and well being the word 'diet' means the sort of food that people regularly eat .
af: vir voedingkundiges mense wat die effek van dieet op gesondheid en welstand bestudeer beteken die woord dieet die soort voedsel wat mense gereeld eet .

source: when we say we eat a healthy balanced diet we mean that we eat food that contains adequate or the right amounts of all the nutrients our body needs to function .
af: wanneer ons s ons eet 'n gebalanseerde dieet dan beteken dit ons eet voedsel wat genoeg of die regte hoeveelheid van al die voedingstowwe wat ons liggaam benodig bevat .

source: a food pyramid provides a guide to a healthy balanced diet .
af: 'n voedselpiramide gee vir ons 'n riglyn van 'n gesonde gebalanseerde dieet .

source: it shows how to classify food types into different levels .
af: dit illustreer hoe om kossoorte in verskillende vlakke te klassifiseer .

source: a balanced healthy diet will include servings from each level of the food pyramid and will show the correct quantities you need to eat
af: 'n gesonde gebalanseerde dieetsal porsies uit elke vlak van die voedselpiramide insluit asook die regte hoeveelhede wat jy nodig het .

source: here is an example of a food pyramid
af: hier is 'n voorbeeld van 'n voedselpiramide .

source: some people eat a very unhealthy diet and turn the food pyramid upside down !
af: sommige mense eet baie ongesond hulle draai die voedselpiramide onderstebo !

source: they eat far more sweets cakes fatty rich food and far less vegetables and starches !
af: hulle eet baie meer lekkernye koek ryk vetterige kos en baie minder groente grane en stysels !

source: toast with peanut butter coffee with milk and 3 teaspoons of sugar
af: roosterbrood met grondboontjie botter koffie met melk en drie teelepels suiker

source: two minute noodles cream soda jelly while watching tv
af: kitsnoedels cream soda jellie terwyl hy tv kyk

source: spaghetti bolognese with chopped carrots in the mince with cheese sprinkled on top fruit juice tea with milk and 2 teaspoons of sugar
af: spaghetti bolognaise met gekapte wortels in die maalvleis met kaas bo oor gestrooi vrugtesap tee met melk en twee teelepels suiker

source: two minute noodles coke toast with peanut butter popcorn while watching tv
af: kitsnoedels coke roosterbrood met grondboontjie botter springmielies terwyl hy tvkyk

source: mom and dad worked late scrambled egg on toast with baked beans; coffee with milk and 3 teaspoons of sugar
af: ma en pa het laat gewerk roereier op roosterbrood met gebakte bone; k

source: late for school didn't eat .
af: laat vir skool eet nie .

source: 2 eggs and toast with cheese tea with milk and 3 sugars more toast with jam and peanut butter later while watching tv
af: twee eiers en roosterbrood met kaas tee met melk en drie teelepels suiker later nog roosterbrood met konfyt en grondboontjie botter terwyl hy tv kyk

source: hawaiian pizza coke cream soda chocolate milkshake
af: hawaiese pizza coke cream soda sjokolademelk skommel

source: toast with peanut butter coffee with milk and 3 teaspoons of sugars
af: roosterbrood met grondboontjie botter koffie met melk en drie teelepels suiker

source: indoor hockey practice after school pie from tuckshop and coke chocolate and packet of hot chips
af: binnenshuise hokkieoefening na skool pastei van die snoepie en coke sjokolade en 'n pakkie slaptjips

source: roast chicken butternut baked potatoes salad fruit juice coffee with milk and 1 teaspoon of sugar
af: geroosterde hoender botterskorsie gebakteaartappels slaai vrugtesap koffie met melk en drie teelepels suiker

source: toast with butter peanut butter is finished coffee with milk and 3 teaspoons of sugar
af: roosterbrood met botter die grondboontjiebotter is op koffie met melk en drie teelepels suiker

source: band practice after school pie and coke from tuckshop sweets
af: orkesoefening na skool pastei van die snoepie en coke lekkers

source: takeaway chicken in a bucket hot chips coke tea with milk and 3 teaspoons of sugar popcorn
af: 'n groot houer wegneem hoender slaptjips coke tee met melk en drie teelepels suiker springmielies

source: reading only this table showing rajesh's weekly diet do you think he has a balanced diet ?
af: as jy deur hierdie tabel met rajesh se weeklikse dieet lees dink jy hy volg 'n gebalanseerde dieet ?

source: assess the learner's capability to make conclusions from the data presented .
af: assesseer die leerders se vermo om gevolgtrekkings te maak gebaseer op die data wat gegee word .

source: rajesh does not have a balanced diet for a few reasons .
af: rajesh volg nie 'n gebalanseerde dieet nie om 'n hele paar redes .

source: he consumes a lot of sugar oil and fat in the sweets coke takeaways and sugar in his drinks .
af: hy neem baie suiker olie en vette in deur die lekkers coke wegneemetes en suiker in sy drankies .

source: he also has a lot of starch but not much fresh fruit and vegetables .
af: hy eet ook baie stysel maar nie baie vars vrugte en groente nie .

source: now let's use our knowledge of a food pyramid to see how healthy rajesh's diet for the week was .
af: kom ons gebruik nou ons kennis van 'n voedselpiramide om te bepaal hoe gesond rajesh se dieet vir die week was .

source: use the tallying method to keep score of everything he ate to tally up results you make one line down for every item you count and when you get to the fifth item you draw a diagonal line through the other four .
af: gebruik die telmetode om rekord te hou van alles wat hy geet het maak een vertikale strepie vir elke item wat jy tel en wanneer jy by die vyfde item kom trek 'n horisontale strepie deur die ander vier .

source: that makes it easy to count in fives and count the few left over at the end .
af: dit maak dit maklik om in vywe te tel en dan die origes aan die einde by te tel .

source: list the times and days when rajesh ate fruit or vegetables .
af: lys die tye en dae wat rajesh vrugte of groente ingeneem het .
